# --------------------------------------------------------
# 提供强化学习环境参数和一些工具函数
# --------------------------------------------------------
import numpy as np

'''
    绘图相关参数
'''
# 图像的默认宽高
DEFAULT_HEIGHT = 1000
DEFAULT_WIDTH = 1000
# 兴趣点被采集后的颜色BGR
POI_COLOR_GATHER = (240, 120, 60)
# 兴趣点被完整采集后的颜色BGR
POI_COLOR_OVER = (120, 240, 60)
# 障碍物的颜色BGR
OBS_COLOR = (150, 150, 150)
# 白色BGR
WHITE_COLOR = (255, 255, 255)
# 飞机颜色BGR
UAV_COLOR = [(100, 150, 250), (100, 150, 150), (100, 75, 125), (100, 75, 75), (100, 150, 0)]
